{"keras_version": "1.2.1", "class_name": "Sequential", "config": [{"class_name": "Lambda", "config": {"input_dtype": "float32", "function_type": "lambda", "output_shape_type": "raw", "arguments": {}, "batch_input_shape": [null, 49, 224, 3], "trainable": true, "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003Ng\u0000\u0000\u0000\u0000\u0000\u00e0_@g\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0001\u0000\u0000\u0000r\u0001\u0000\u0000\u0000\u00fa\u001f<ipython-input-47-fc64fa966cb7>\u00da\b<lambda>\u0002\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "name": "lambda_3", "output_shape": null}}, {"class_name": "Convolution2D", "config": {"nb_col": 1, "nb_row": 1, "dim_ordering": "tf", "trainable": true, "b_constraint": null, "name": "convolution2d_9", "W_constraint": null, "border_mode": "same", "init": "glorot_uniform", "b_regularizer": null, "bias": true, "activity_regularizer": null, "subsample": [1, 1], "activation": "relu", "nb_filter": 3, "W_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"dim_ordering": "tf", "strides": [2, 2], "pool_size": [2, 2], "name": "maxpooling2d_9", "trainable": true, "border_mode": "valid"}}, {"class_name": "Dropout", "config": {"name": "dropout_13", "trainable": true, "p": 0.1}}, {"class_name": "Convolution2D", "config": {"nb_col": 5, "nb_row": 5, "dim_ordering": "tf", "trainable": true, "b_constraint": null, "name": "convolution2d_10", "W_constraint": null, "border_mode": "same", "init": "glorot_uniform", "b_regularizer": null, "bias": true, "activity_regularizer": null, "subsample": [1, 1], "activation": "relu", "nb_filter": 32, "W_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"dim_ordering": "tf", "strides": [2, 2], "pool_size": [2, 2], "name": "maxpooling2d_10", "trainable": true, "border_mode": "valid"}}, {"class_name": "Dropout", "config": {"name": "dropout_14", "trainable": true, "p": 0.2}}, {"class_name": "Convolution2D", "config": {"nb_col": 5, "nb_row": 5, "dim_ordering": "tf", "trainable": true, "b_constraint": null, "name": "convolution2d_11", "W_constraint": null, "border_mode": "same", "init": "glorot_uniform", "b_regularizer": null, "bias": true, "activity_regularizer": null, "subsample": [1, 1], "activation": "relu", "nb_filter": 64, "W_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"dim_ordering": "tf", "strides": [2, 2], "pool_size": [2, 2], "name": "maxpooling2d_11", "trainable": true, "border_mode": "valid"}}, {"class_name": "Dropout", "config": {"name": "dropout_15", "trainable": true, "p": 0.2}}, {"class_name": "Convolution2D", "config": {"nb_col": 3, "nb_row": 3, "dim_ordering": "tf", "trainable": true, "b_constraint": null, "name": "convolution2d_12", "W_constraint": null, "border_mode": "same", "init": "glorot_uniform", "b_regularizer": null, "bias": true, "activity_regularizer": null, "subsample": [1, 1], "activation": "relu", "nb_filter": 64, "W_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"dim_ordering": "tf", "strides": [2, 2], "pool_size": [2, 2], "name": "maxpooling2d_12", "trainable": true, "border_mode": "valid"}}, {"class_name": "Flatten", "config": {"name": "flatten_3", "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_16", "trainable": true, "p": 0.3}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "trainable": true, "b_constraint": null, "name": "dense_7", "W_constraint": null, "init": "glorot_uniform", "b_regularizer": null, "output_dim": 512, "bias": true, "activation": "relu", "W_regularizer": null, "input_dim": 2688}}, {"class_name": "Dropout", "config": {"name": "dropout_17", "trainable": true, "p": 0.5}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "trainable": true, "b_constraint": null, "name": "dense_8", "W_constraint": null, "init": "glorot_uniform", "b_regularizer": null, "output_dim": 10, "bias": true, "activation": "tanh", "W_regularizer": null, "input_dim": 512}}, {"class_name": "Dropout", "config": {"name": "dropout_18", "trainable": true, "p": 0.2}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "trainable": true, "b_constraint": null, "name": "dense_9", "W_constraint": null, "init": "glorot_uniform", "b_regularizer": null, "output_dim": 1, "bias": true, "activation": "linear", "W_regularizer": null, "input_dim": 10}}]}