{"class_name": "Sequential", "keras_version": "1.2.1", "config": [{"class_name": "Lambda", "config": {"trainable": true, "batch_input_shape": [null, 49, 224, 3], "arguments": {}, "output_shape": null, "name": "lambda_1", "output_shape_type": "raw", "input_dtype": "float32", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0_@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>z\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "function_type": "lambda"}}, {"class_name": "Convolution2D", "config": {"b_regularizer": null, "nb_row": 1, "dim_ordering": "tf", "nb_filter": 3, "W_regularizer": null, "W_constraint": null, "border_mode": "same", "init": "glorot_uniform", "nb_col": 1, "subsample": [1, 1], "bias": true, "b_constraint": null, "activation": "relu", "name": "convolution2d_1", "trainable": true, "activity_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "trainable": true, "dim_ordering": "tf", "pool_size": [2, 2], "border_mode": "valid", "name": "maxpooling2d_1"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_1", "p": 0.1}}, {"class_name": "Convolution2D", "config": {"b_regularizer": null, "nb_row": 5, "dim_ordering": "tf", "nb_filter": 32, "W_regularizer": null, "W_constraint": null, "border_mode": "same", "init": "glorot_uniform", "nb_col": 5, "subsample": [1, 1], "bias": true, "b_constraint": null, "activation": "relu", "name": "convolution2d_2", "trainable": true, "activity_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "trainable": true, "dim_ordering": "tf", "pool_size": [2, 2], "border_mode": "valid", "name": "maxpooling2d_2"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_2", "p": 0.2}}, {"class_name": "Convolution2D", "config": {"b_regularizer": null, "nb_row": 5, "dim_ordering": "tf", "nb_filter": 64, "W_regularizer": null, "W_constraint": null, "border_mode": "same", "init": "glorot_uniform", "nb_col": 5, "subsample": [1, 1], "bias": true, "b_constraint": null, "activation": "relu", "name": "convolution2d_3", "trainable": true, "activity_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "trainable": true, "dim_ordering": "tf", "pool_size": [2, 2], "border_mode": "valid", "name": "maxpooling2d_3"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_3", "p": 0.2}}, {"class_name": "Convolution2D", "config": {"b_regularizer": null, "nb_row": 3, "dim_ordering": "tf", "nb_filter": 64, "W_regularizer": null, "W_constraint": null, "border_mode": "same", "init": "glorot_uniform", "nb_col": 3, "subsample": [1, 1], "bias": true, "b_constraint": null, "activation": "relu", "name": "convolution2d_4", "trainable": true, "activity_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "trainable": true, "dim_ordering": "tf", "pool_size": [2, 2], "border_mode": "valid", "name": "maxpooling2d_4"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_4", "p": 0.3}}, {"class_name": "Dense", "config": {"b_regularizer": null, "bias": true, "W_regularizer": null, "input_dim": 2688, "init": "glorot_uniform", "W_constraint": null, "output_dim": 512, "b_constraint": null, "activity_regularizer": null, "name": "dense_1", "trainable": true, "activation": "relu"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_5", "p": 0.5}}, {"class_name": "Dense", "config": {"b_regularizer": null, "bias": true, "W_regularizer": null, "input_dim": 512, "init": "glorot_uniform", "W_constraint": null, "output_dim": 10, "b_constraint": null, "activity_regularizer": null, "name": "dense_2", "trainable": true, "activation": "tanh"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_6", "p": 0.2}}, {"class_name": "Dense", "config": {"b_regularizer": null, "bias": true, "W_regularizer": null, "input_dim": 10, "init": "glorot_uniform", "W_constraint": null, "output_dim": 1, "b_constraint": null, "activity_regularizer": null, "name": "dense_3", "trainable": true, "activation": "linear"}}]}